{
  "backend/main.mo": "Main Motoko actor defining all data types (UserProfile, HotelBooking, CabBooking, SalesOrder, etc.), in-memory state maps, and business logic for a travel/hospitality platform including bookings, orders, inquiries, payments, and admin credential management with authorization mixin.",
  "backend/migration.mo": "Migration module that upgrades the actor state from OldActor (without admin credentials) to NewActor by injecting default adminUsername and adminPassword fields.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of the admin dashboard username/password login screen feature, listing affected files, component dependencies, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference index for the frontend codebase.",
  "frontend/index.css": "Empty CSS file (no content).",
  "frontend/index.html": "HTML entry point for the Travel Break app that pre-applies dark mode, sets favicon and title, and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app component that configures TanStack Router with all application routes (hotel, cab, driver, store, admin, etc.) and wraps everything in a forced-dark ThemeProvider with a Toaster.",
  "frontend/src/components/admin/AdminKpiCards.tsx": "Reusable component that renders a responsive grid of KPI stat cards, each showing a label, numeric value, and colored icon.",
  "frontend/src/components/admin/AdminManagementSection.tsx": "Admin management UI card that displays the current admin's principal, provides a form to grant admin access to new principals via the addAdmin mutation, and shows informational alerts.",
  "frontend/src/components/admin/CabManagementSection.tsx": "Admin UI section for managing cab types, allowing admins to view, create, and delete cab types with name, capacity, pricing, and image fields.",
  "frontend/src/components/admin/HotelManagementSection.tsx": "Admin UI section for managing hotel room types, supporting creation and deletion of room types with pricing, features, and image URLs.",
  "frontend/src/components/admin/OrderManagementSection.tsx": "Admin UI section that displays all sales orders in a table and allows admins to confirm or cancel orders with a confirmation dialog.",
  "frontend/src/components/admin/RecentActivityFeed.tsx": "Displays a scrollable feed of recent platform activities (bookings, orders, inquiries, payments) with icons, status badges, and timestamps.",
  "frontend/src/components/admin/StatusSelect.tsx": "Reusable dropdown select component for choosing a status value, with an optional loading spinner when disabled.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied screen with contextual messaging based on authentication state, offering navigation home or a login prompt.",
  "frontend/src/components/auth/AdminLoginForm.tsx": "Renders a styled admin login form card with username/password inputs, error display, and loading state, calling an `onLogin` callback on submit.",
  "frontend/src/components/auth/AuthModal.tsx": "Dialog modal for user authentication via Internet Identity, showing sign-in options or account info (order history, support, payment) when already authenticated, and triggering profile setup if no profile exists.",
  "frontend/src/components/auth/OwnerGuard.tsx": "Route guard that shows the AdminLoginForm when unauthenticated and wraps children in an OwnerSessionContext (providing a logout function) when authenticated.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that collects a new user's name, email, and phone on first login and saves the profile via the `useSaveCallerUserProfile` mutation.",
  "frontend/src/components/availability/AvailabilityLegend.tsx": "Small presentational component rendering a color-coded legend for available vs. booked/blocked calendar dates.",
  "frontend/src/components/layout/AppShell.tsx": "Top-level layout wrapper that composes HeaderNav, a main content area, and Footer into a full-height flex column.",
  "frontend/src/components/layout/Footer.tsx": "Site footer displaying the copyright year and a branded attribution link to caffeine.ai.",
  "frontend/src/components/layout/HeaderNav.tsx": "Sticky header with logo, desktop nav links (Home, Order History, service pages), an auth button, and a mobile slide-out Sheet menu.",
  "frontend/src/data/hotelReviews.ts": "Static array of hotel review objects with helper functions to compute the overall average rating and the average rating for a specific room type.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAdminSession.ts": "Hook managing admin session state (persisted in sessionStorage) with login/logout functions that call `actor.verifyAdminCredentials` and track loading/error state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, including login, logout, and identity state management using DFINITY's AuthClient.",
  "frontend/src/hooks/useOwnerAuth.ts": "Custom hook that checks whether the currently authenticated user is an admin by querying the backend actor's `isCallerAdmin` method.",
  "frontend/src/hooks/useOwnerRecords.ts": "Collection of React Query hooks for admin-only data fetching (all bookings, orders, inquiries, payments) and mutations for managing room types, cab types, and other records.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user-facing data fetching and mutations covering user profiles, hotel bookings, cab bookings, acting driver requests, sales orders, inquiries, and payments.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines CSS custom properties for light/dark theme tokens, and provides utility classes for hero image overlays and content layering.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/ActingDriverBookingPage.tsx": "Page component for requesting an acting driver service, featuring a form with vehicle type, service details, and a date/time picker that respects blocked dates, plus a confirmation view after submission.",
  "frontend/src/pages/CabBookingPage.tsx": "Page for booking cab services, allowing users to select a cab type, enter pickup/dropoff locations, choose a date/time, and view their existing bookings. Handles blocked date validation and availability checks before confirming a booking.",
  "frontend/src/pages/CustomerCarePage.tsx": "Page for submitting customer support inquiries with a contact info field and message textarea, and displaying the user's past inquiry history with status badges.",
  "frontend/src/pages/HomePage.tsx": "Landing page with a hero section and a grid of service cards linking to Hotels, Cab Booking, Acting Driver, and Store pages.",
  "frontend/src/pages/HotelBookingPage.tsx": "Page for booking hotel rooms where users select a room type, check-in/check-out dates, and see pricing breakdowns including deposit amounts. Validates date conflicts against blocked ranges before confirming a booking.",
  "frontend/src/pages/HotelReviewsPage.tsx": "Page that displays a list of static guest reviews for hotel stays, showing star ratings, reviewer names, room types, and comments alongside an overall average rating.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Page showing the authenticated user's store order history with options to update the delivery date or cancel pending orders, displaying status and payment plan labels for each order.",
  "frontend/src/pages/OwnerDashboardPage.tsx": "Owner dashboard page protected by OwnerGuard that displays KPI cards, recent activity, and tabbed management sections for hotel bookings, cab bookings, driver requests, sales orders, inquiries, and payments with status update capabilities.",
  "frontend/src/pages/PaymentReceivingPage.tsx": "Page allowing authenticated users to submit payment records (reference, amount, note) for verification, and view their past payment submissions with status badges.",
  "frontend/src/pages/SalesStorePage.tsx": "E-commerce store page that displays products (from backend or sample fallback), supports a cart with quantity management, and handles checkout with delivery details and payment plan selection (full or partial upfront).",
  "frontend/src/state/cart.ts": "Zustand store managing shopping cart state with actions to add, remove, update quantity, clear items, and calculate total price based on product offer prices.",
  "frontend/src/utils/availability.ts": "Utility functions for booking availability checks, including converting nanosecond timestamps to dates, checking if a date or date range overlaps with blocked DateRange intervals, and generating a list of all blocked dates for calendar display.",
  "frontend/src/utils/format.ts": "Utility functions for formatting bigint nanosecond timestamps to human-readable date/datetime strings, formatting numbers or bigints as INR currency, and converting between Date objects and nanosecond bigints.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, persisting them in sessionStorage, and cleaning sensitive parameters from the URL hash without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based colors, border radii, accordion animations, and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current state of the Travel Admin Portal project, including existing features (admin dashboard username/password login screen) and pending feature requests for backend credential verification and frontend authentication flow."
}