{
  "backend/main.mo": "Defines actor with user, booking, product, inquiry, and payment types plus maps for storing records and authorization logic.",
  "feature_evidence.json": "Lists implemented features with related files, components, test IDs, and confidence evidence.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend pages, utilities, and components.",
  "frontend/index.css": "Empty CSS file placeholder.",
  "frontend/index.html": "Basic HTML entry point loading the React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/auth/AuthModal.tsx": "Authentication modal supporting Internet Identity login, mock Google login message, and profile setup trigger.",
  "frontend/src/components/auth/OwnerGuard.tsx": "Guard component restricting access to admin-only pages with loading and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for collecting and saving a new user's profile details.",
  "frontend/src/components/layout/AppShell.tsx": "App layout wrapper with header, footer, and main content slot.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing copyright, branding, and link to caffeine.ai.",
  "frontend/src/components/layout/HeaderNav.tsx": "React navigation header with links, mobile menu, auth modal triggers, and admin dashboard access based on identity and owner auth.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the Internet Identity, refreshing queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identity loading, and auth client configuration.",
  "frontend/src/hooks/useOwnerAuth.ts": "Checks via actor whether the current caller is an admin and exposes loading and error state.",
  "frontend/src/hooks/useOwnerRecords.ts": "Fetches all admin-level records like bookings, orders, inquiries, and payments using the actor.",
  "frontend/src/hooks/useQueries.ts": "Provides user-facing queries and mutations for profiles, bookings, cab types, products, payments, and related actions via the actor.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables, dark mode values, and utility classes for overlays and hero backgrounds.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, identity provider, and global styles.",
  "frontend/src/pages/ActingDriverBookingPage.tsx": "Provides a form to request an acting driver, handles authentication, form submission, and displays confirmation.",
  "frontend/src/pages/CabBookingPage.tsx": "Enables users to select cab types, enter trip details, book a cab, and view a confirmation screen.",
  "frontend/src/pages/CustomerCarePage.tsx": "Allows users to submit customer care inquiries, view their inquiries, and see a confirmation message.",
  "frontend/src/pages/HomePage.tsx": "Displays a landing page with service categories and navigation links to different booking sections.",
  "frontend/src/pages/HotelBookingPage.tsx": "Lets users select room types and dates, calculates pricing, submits hotel bookings, and shows confirmation.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Shows a user's sales orders with options to update delivery dates or cancel pending orders.",
  "frontend/src/pages/OwnerDashboardPage.tsx": "Renders an owner dashboard with stats, tabs, and a unified activity feed using multiple data-fetching hooks.",
  "frontend/src/pages/PaymentReceivingPage.tsx": "Provides a form for users to submit payment records and view a confirmation screen after submission.",
  "frontend/src/pages/SalesStorePage.tsx": "Implements a simple product store with cart management, checkout flow, and order submission.",
  "frontend/src/state/cart.ts": "Defines a Zustand store for cart items with add, remove, update, clear, and total price utilities.",
  "frontend/src/utils/format.ts": "Offers helper functions for formatting dates, datetimes, currency, and converting timestamps.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters, supporting hash routing.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, animations, container settings, and plugins.",
  "project_state.json": "Contains project state metadata, key auth and payment changes, architectural notes, known issues, image edit requirements, and a list of existing features with their versions."
}