{
  "backend/main.mo": "Main backend actor defining all types (bookings, orders, inquiries, payments, availability) and state maps, with authorization mixin and helper functions for ID generation and room availability management.",
  "feature_evidence.json": "Feature evidence report documenting the removal of the admin dashboard navigation link from HeaderNav component with high confidence.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend source files including pages, components, hooks, and utilities with their key functionality.",
  "frontend/index.css": "Empty CSS file (content truncated or minimal).",
  "frontend/index.html": "HTML entry point with dark mode class applied immediately via inline script to prevent flash, includes favicon and root div for React mounting.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with all routes (home, hotel, cab, driver, store, customer care, payment, admin dashboard, order history) wrapped in ThemeProvider forcing dark mode.",
  "frontend/src/components/admin/AdminKpiCards.tsx": "Reusable KPI card grid component displaying statistics with icons, values, and labels in a responsive layout.",
  "frontend/src/components/admin/AdminManagementSection.tsx": "Admin management interface allowing authorized admins to grant admin access to other users by entering their principal ID, with current admin info display and informational alerts.",
  "frontend/src/components/admin/RecentActivityFeed.tsx": "Scrollable activity feed component displaying recent bookings, orders, inquiries, and payments with type-specific icons, status badges, and formatted timestamps sorted by recency.",
  "frontend/src/components/admin/StatusSelect.tsx": "Reusable status dropdown select component with loading spinner support and configurable options for updating record statuses.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied screen for unauthorized users attempting to access admin areas, with options to return home or sign in based on authentication status.",
  "frontend/src/components/auth/AuthModal.tsx": "Modal dialog for authentication that handles Internet Identity login/logout, displays user profile info when authenticated, and provides navigation to order history, support, and payment pages.",
  "frontend/src/components/auth/OwnerGuard.tsx": "Route guard component that verifies admin access using useOwnerAuth hook and displays AccessDeniedScreen if user lacks admin privileges.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal form for new users to complete their profile setup with name (required), email, and phone fields, preventing dismissal until completed.",
  "frontend/src/components/availability/AvailabilityLegend.tsx": "Simple legend component showing visual indicators for available and booked/blocked availability states in a calendar view.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper component that structures the app with HeaderNav, main content area, and Footer in a flex column layout.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying copyright information and a 'Built with caffeine.ai' attribution link with UTM tracking parameters.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive navigation header with logo, service links (hotel, cab, driver, store), authentication button, and mobile menu drawer for smaller screens.",
  "frontend/src/data/hotelReviews.ts": "Static hotel review data with 6 sample reviews and utility functions to calculate average ratings overall and per room type.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, handling admin token initialization and query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useOwnerAuth.ts": "Custom hook that checks if the current authenticated user is an admin by querying the backend actor's isCallerAdmin method.",
  "frontend/src/hooks/useOwnerRecords.ts": "Provides React Query hooks for admin users to fetch all bookings, inquiries, payments, and sales orders, plus mutations to update booking statuses and manage admin roles.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user-facing operations including user profiles, hotel/cab bookings, room/cab availability, acting driver requests, sales orders, inquiries, and payments.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including color schemes, sidebar styling, and utility classes for background overlays and hero images.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/ActingDriverBookingPage.tsx": "Page component for requesting acting driver services with form inputs for vehicle type, service details, date/time selection, calendar with blocked dates, and displays user's previous requests.",
  "frontend/src/pages/CabBookingPage.tsx": "Cab booking page allowing users to select cab types, specify pickup/dropoff locations and times, view availability and blocked dates, and submit bookings with confirmation display.",
  "frontend/src/pages/CustomerCarePage.tsx": "Customer care page for submitting inquiries with contact information and message, displaying submission confirmation and listing user's past inquiries with status badges.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section and service cards linking to hotels, cab booking, acting driver, and store sections with gradient backgrounds and icons.",
  "frontend/src/pages/HotelBookingPage.tsx": "Hotel booking page for selecting room types, choosing check-in/check-out dates with blocked date validation, calculating pricing with deposit, and confirming reservations.",
  "frontend/src/pages/HotelReviewsPage.tsx": "Displays a list of hotel guest reviews with ratings, room types, and comments, showing average rating and total review count.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Order history page showing user's sales orders with status badges, payment plan details, and functionality to update delivery dates or cancel pending orders.",
  "frontend/src/pages/OwnerDashboardPage.tsx": "Owner dashboard page that displays KPIs, recent activities, and management sections for all business entities (hotel bookings, cab bookings, driver requests, sales orders, inquiries, payments) with status update capabilities.",
  "frontend/src/pages/PaymentReceivingPage.tsx": "Payment submission page where authenticated users can submit payment records with reference, amount, and notes, displaying a confirmation screen and listing their previous payment submissions.",
  "frontend/src/pages/SalesStorePage.tsx": "E-commerce store page displaying sample products with offer prices, shopping cart functionality, and checkout flow with payment plan options (full upfront or partial upfront).",
  "frontend/src/state/cart.ts": "Zustand store managing shopping cart state with operations to add, remove, update quantities, clear cart, and calculate total price based on product offer prices.",
  "frontend/src/utils/availability.ts": "Utility functions for handling booking availability including date normalization, checking if dates are blocked, detecting range overlaps, and converting between bigint nanosecond timestamps and JavaScript Dates.",
  "frontend/src/utils/format.ts": "Formatting utilities for converting bigint timestamps to readable dates/datetimes, formatting currency in INR, and converting between JavaScript Dates and nanosecond timestamps.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, managing sessionStorage persistence, and clearing sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom animations (accordion), border radius variables, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file documenting feature requests to remove the admin dashboard navigation link from HeaderNav while keeping the /admin route accessible directly via URL."
}